<!DOCTYPE html>
<html lang="gl">

  <head>
  <meta charset="utf-8"/>
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1"/>

  <title>Howto - Translating PDF files with Iceni Infix and OmegaT - OmegaT</title>

  
  <link rel="apple-touch-icon" sizes="180x180"    href="/apple-touch-icon.png">
  <link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
  <link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
  <link rel="manifest"                            href="/manifest.json">
  <link rel="mask-icon" color="#5bbad5"           href="/safari-pinned-tab.svg">
  <meta name="apple-mobile-web-app-title" content="OmegaT">
  <meta name="application-name" content="OmegaT">
  <meta name="theme-color" content="#ffffff">

  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"/>
  <link type="text/css" rel="stylesheet" href="/gl/assets/omegat.css">

  <script src="https://ajax.googleapis.com/ajax/libs/jquery/1.12.4/jquery.min.js"></script>
  <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
  <script type="text/javascript" src="/gl/assets/omegat.js"></script>


  <meta name="description" content="OmegaT is a free open-source translation memory application for professional translators written in Java.">

  <link rel="canonical" href="http://omegat.org/gl/howtos/iceni_infix">

  
    <!-- Google Analytics -->
  <script>
    (function(i,s,o,g,r,a,m){ i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){ (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o), m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m) })(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
    ga('create', 'UA-87327-16', 'auto');
    ga('send', 'pageview');
  </script>

  

  <!-- SEO tags -->
  
  <meta property="og:title"       content="Howto - Translating PDF files with Iceni Infix and OmegaT - OmegaT" />
  <meta property="og:description" content="OmegaT is a free open-source translation memory application for professional translators written in Java." />
  <meta property="og:url"         content="http://omegat.org/gl/howtos/iceni_infix" />
  <meta property="og:site_name"   content="OmegaT - The Free Translation Memory Tool" />
  
  <meta name="twitter:card" content="summary" />
  <meta name="twitter:site" content="@OmegaTOfficial" />
  <script type="application/ld+json">
  {
    "@context": "http://schema.org",
    "@type": "WebSite",
    "name": "",
    "url": "http://omegat.org/gl",
    "headline": "Howto - Translating PDF files with Iceni Infix and OmegaT",
    "description": "OmegaT is a free open-source translation memory application for professional translators written in Java.",
    "publisher": {
      "@type": "Organization",
      "logo": {
        "@type": "ImageObject",
        "url": "http://omegat.org/img/omegat_96.png"
      }
    },
    "sameAs": ["https://sourceforge.net/projects/omegat/","https://github.com/omegat-org/","https://twitter.com/OmegaTOfficial","https://www.facebook.com/OmegaTOfficial"]
  }</script>
  <!-- /SEO tags -->
</head>



  <body id="page">

    <nav class="navbar navbar-default">
  <div class="container-fluid">
    <div class="navbar-header">
      <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#omegat-menu" aria-expanded="false">
        <span class="sr-only">Toggle navigation</span>
        <span class="icon-bar"><!----></span>
        <span class="icon-bar"><!----></span>
        <span class="icon-bar"><!----></span>
      </button>
      <a class="navbar-brand" href="/gl/">
        <img alt="OmegaT" class="logo-omegat" src="/img/omegat.svg" height="80" width="80"/>
      </a>
    </div>
    <div class="collapse navbar-collapse navbar-right" id="omegat-menu">
      <ul class="nav navbar-nav">
        <li><a href="/gl/download">Descargue OmegaT</a></li>
      </ul>
      <ul class="nav navbar-nav">
        <li><a href="/gl/resources">Outros recursos de OmegaT</a></li>
        <li><a href="/gl/documentation">Documentation</a></li>
      </ul>
      <ul class="nav navbar-nav">
        <li class="dropdown">
          <a href="#" class="dropdown-toggle" data-toggle="dropdown" role="button" aria-haspopup="true" aria-expanded="false">
            <span data-toggle="popover" class="language-popover" data-trigger="manual" data-container="body" title="-" data-content="-" data-placement="bottom">
              Languages<span class="caret"><!----></span> <span class="sr-only">(current)</span>
            </span>
          </a>
          <ul class="dropdown-menu languages">
            
            <li><a href="/ar/howtos/iceni_infix">&#x628;&#x627;&#x644;&#x639;&#x631;&#x628;&#x64A;&#x629;</a></li>
            
            <li><a href="/ca/howtos/iceni_infix">Catal&#xE0;</a></li>
            
            <li><a href="/cz/howtos/iceni_infix">&#x10C;e&#x161;tina</a></li>
            
            <li><a href="/de/howtos/iceni_infix">Deutsch</a></li>
            
            <li><a href="/el/howtos/iceni_infix">&#x395;&#x3BB;&#x3BB;&#x3B7;&#x3BD;&#x3B9;&#x3BA;&#x3AC;</a></li>
            
            <li><a href="/howtos/iceni_infix">English</a></li>
            
            <li><a href="/es/howtos/iceni_infix">Espa&#xF1;ol</a></li>
            
            <li><a href="/fr/howtos/iceni_infix">Fran&#xE7;ais</a></li>
            
            <li><a href="/gl/howtos/iceni_infix">Galego</a></li>
            
            <li><a href="/id/howtos/iceni_infix">Bahasa Indonesia</a></li>
            
            <li><a href="/ia/howtos/iceni_infix">Interlingua</a></li>
            
            <li><a href="/it/howtos/iceni_infix">Italiano</a></li>
            
            <li><a href="/ko/howtos/iceni_infix">&#xD55C;&#xAD6D;&#xC5B4;</a></li>
            
            <li><a href="/hu/howtos/iceni_infix">Magyar</a></li>
            
            <li><a href="/ja/howtos/iceni_infix">&#x65E5;&#x672C;&#x8A9E;</a></li>
            
            <li><a href="/nl/howtos/iceni_infix">Nederlands</a></li>
            
            <li><a href="/pl/howtos/iceni_infix">Polski</a></li>
            
            <li><a href="/pt_BR/howtos/iceni_infix">Portugu&#xEA;s (Brazil)</a></li>
            
            <li><a href="/pt/howtos/iceni_infix">Portugu&#xEA;s (Portugal)</a></li>
            
            <li><a href="/ru/howtos/iceni_infix">&#x420;&#x443;&#x441;&#x441;&#x43A;&#x438;&#x439;</a></li>
            
            <li><a href="/sq/howtos/iceni_infix">Shqip</a></li>
            
            <li><a href="/sk/howtos/iceni_infix">Sloven&#x10D;ina</a></li>
            
            <li><a href="/si/howtos/iceni_infix">Sloven&#x161;&#x10D;ina</a></li>
            
            <li><a href="/hr/howtos/iceni_infix">Srpskohrvatski</a></li>
            
            <li><a href="/fi/howtos/iceni_infix">Suomi</a></li>
            
            <li><a href="/sv/howtos/iceni_infix">Svenska</a></li>
            
            <li><a href="/uk/howtos/iceni_infix">Українська</a></li>
            
            <li><a href="/zh_CN/howtos/iceni_infix">&#x7B80;&#x4F53;&#x4E2D;&#x6587;</a></li>
            
            <li><a href="/zh_TW/howtos/iceni_infix">&#x7E41;&#x9AD4;&#x4E2D;&#x6587;</a></li>
            
          </ul>
        </li>
      </ul>
    </div>
  </div>
</nav>


    <div class="jumbotron jumbo-page titles-howtos-iceni_infix"><h1>Howto - Translating PDF files with Iceni Infix and OmegaT</h1></div>
        
    <div class="container">

<h2>Gu&iacute;a: Traducir ficheiros en formato PDF con Iceni Infix e OmegaT</h2>

<p>Esta gu&iacute;a explica como usar OmegaT e Iceni Infix para traducir ficheiros en formato PDF.</p>

<h3>Situaci&oacute;n</h3>

<p>Existen dous tipos de ficheiros PDF: os \xABverdadeiros\xBB e os \xABescaneados\xBB.</p>

<p>Un ficheiro \xABescaneado\xBB &eacute; un ficheiro no que o formato PDF &eacute; un simple contedor de escaneos de documentos f&iacute;sicos. Polo xeral estes escaneos conte&ntilde;en texto para traducir. Non existe unha forma de traducir un ficheiro PDF escaneado a non ser que recree dende cero o texto, xa sexa copiando o texto ou usando un software de OCR (reco&ntilde;ecemento &oacute;ptico de caracteres), e o formato do texto. Esta gu&iacute;a non vai falar sobre os PDF escaneados.</p>

<p>Os verdadeiros ficheiros PDF (que en ocasi&oacute;ns son denominados como ficheiros PDF \xABnativos\xBB ou \xABdestilados\xBB, inda que \xABdestilados\xBB ten un significado m&aacute;is preciso) son ficheiros que foron exportados dende outro aplicativo, normalmente un programa de autoedici&oacute;n. O proceso adecuado para traducir un ficheiro PDF verdadeiro normalmente pasa por crear a traduci&oacute;n no programa de autoedici&oacute;n no que se creou o texto orixinal e despois seguir os mesmos pasos usados para crear o ficheiro PDF. Editar directamente os ficheiros en formato PDF para traducilos non &eacute; unha opci&oacute;n pr&aacute;ctica. Polo xeral, as persoas que traducen ficheiros en formato PDF optan por convertelos a outro formato de ficheiro antes de traducir, como por exemplo RTF. Os resultados poden ser adecuados para este prop&oacute;sito, pero non acadar&aacute;n os est&aacute;ndares profesionais do proceso orixinal do programa de autoedici&oacute;n.</p>

<h3>Iceni Infix</h3>

<p>Iceni Infix ofrece unha soluci&oacute;n adicional. Infix &eacute; un editor de PDF que permite editar directamente o texto neste tipo de ficheiros. Inda que &eacute; discutible se os resultados deste proceso son comparables a empregar un programa de autoedici&oacute;n profesional &eacute; moi probable que sexan mellores ca converter os ficheiros a formatos totalmente novos (como RTF).</p>

<p>A versi&oacute;n \xABProfesional\xBB de Infix ten unha funci&oacute;n adicional que resulta interesante para as persoas adicadas &aacute; traduci&oacute;n: exportar texto en formato XML. Poder&aacute; exportar o texto a un ficheiro XML e traducilo cunha ferramenta TAC. Poder&aacute; importar de novo o texto traducido a Infix Professional. OmegaT &eacute; unha das ferramentas coas que pode usar este proceso. Describiremos o proceso nesta gu&iacute;a.</p>

<h3>Plataformas</h3>

<p>A pesar de que Infix &eacute; un aplicativo de Windows, Iceni traballou para facilitar o seu uso en Linux e Macintosh. Poder&aacute; usar Infix Professional nestas plataformas a trav&eacute;s de Crossover Linux ou Crossover Macintosh. Crossover Linux e Crossover Macintosh custan aproximadamente uns 40 \x80. Ten demos gratu&iacute;tas dispo&ntilde;ibles. Poder&aacute; obter Crossover Linux e Crossover Macintosh na <a href="http://www.codeweavers.com/products/crossover/">web de Codeweavers</a>. Ten dispo&ntilde;ible <a href="http://www.iceni.com/infixmaclinux.htm">informaci&oacute;n espec&iacute;fica para executar Iceni Infix en Crossover Linux ou Crossover Macintosh</a>.</p>

<h3>Procedemento para traducir un ficheiro en formato PDF</h3>

<p>Obte&ntilde;a Iceni Infix Professional <a href="http://www.iceni.com/infix.htm">na p&aacute;xina web de Iceni</a> e inst&aacute;leo. Ten unha versi&oacute;n de demostraci&oacute;n dispo&ntilde;ible. No momento no que se redactou este texto a versi&oacute;n completa custaba uns 150 $. Se emprega Linux ou Macintosh, obte&ntilde;a e instale a versi&oacute;n de Crossover adecuada antes de instalar Iceni Infix Professional. (Existen informes que indican que &eacute; posible executar Infix a trav&eacute;s de WINE.)</p>

<p>Execute Iceni Infix e abra o ficheiro PDF que desexa traducir. O exemplo desta captura de pantalla &eacute; <a href="http://ec.europa.eu/enterprise/policies/sme/files/sme_definition/sme_user_guide_hu.pdf">a gu&iacute;a de PEME da Comisi&oacute;n Europea en lingua h&uacute;ngara</a>.</p><img src="/img/infix1.png" alt="infix1.png"></img><p>Exporte o texto do PDF no formato XML de Infix con Document &gt; Translate &gt; Export XML. Garde o PDF. Te&ntilde;a en conta: cando exporta o ficheiro XML dende o PDF, Infix crea unha nota no ficheiro na que indica onde pertencen as pezas do texto (\xABstories\xBB), polo que deber&aacute; empregar esta versi&oacute;n do ficheiro cando volva a importar o ficheiro XML traducido.</p>

<p>Cree un proxecto de OmegaT seguindo o m&eacute;todo habitual.</p>

<p>Se est&aacute; empregando a versi&oacute;n de OmegaT 2.3 ou unha superior, s&oacute; ter&aacute; que po&ntilde;er o ficheiro XML exportado dende Infix no cartafol /source do seu proxecto de OmegaT.</p>

<p><i>Se est&aacute; usando unha versi&oacute;n de OmegaT anterior, recomend&aacute;moslle que actualice a unha versi&oacute;n m&aacute;is recente. Unha alternativa que ofrece bos resultados ser&iacute;a traducir o ficheiro XML de Infix empregando filtros de HTML. Para empregar estes filtros s&oacute; ten que cambiar a extensi&oacute;n do ficheiro XML exportado de .xml a .html.</i></p>

<p>Volva a cargar o seu proxecto de OmegaT. Xa pode traducir o texto (como se mostra na captura de pantalla).</p><img src="/img/infix2.png" alt="infix2.png"></img><p>Te&ntilde;a en conta: OmegaT converte as etiquetas &lt;BR/&gt; de Infix a &lt;brx/&gt;. Isto permite empregar a regra de segmentaci&oacute;n de HTML para decidir se a segmentaci&oacute;n deber&iacute;a aplicarse nestes puntos.</p>

<p>Cando remate o proceso de traduci&oacute;n, cree o documento traducido seguindo o procedemento habitual (Ctrl+S, Ctrl+D). Sit&uacute;e o ficheiro XML traducido no cartafol /target do proxecto de OmegaT. <i>Se cambiou a extensi&oacute;n do ficheiro a .html ter&aacute; que cambiar a extensi&oacute;n do ficheiro traducido a .xml.</i></p>

<p>En Iceni Infix ter&aacute; que importar o ficheiro XML traducido de novo <i>ao ficheiro PDF dende o que o exportou</i>.  Garde os cambios.</p>

<p>Se todo foi ben, o ficheiro traducido ser&aacute; similar ao orixinal, pero ter&aacute; o texto traducido. (Na captura de pantalla pode ver que s&oacute; os tres primeiros segmentos foron traducidos.)</p>

<p>Te&ntilde;a en conta que se usou a versi&oacute;n de demostraci&oacute;n de Iceni Infix para realizar este proceso o ficheiro PDF traducido ter&aacute; unha marca de auga de Iceni. Para traduci&oacute;ns nas que non precise un resultado profesional, este non deber&iacute;a ser un problema. Iceni Infix tam&eacute;n lle permite gardar ficheiros PDF en formato RTF, pero neste caso a versi&oacute;n de demostraci&oacute;n s&oacute; &eacute; &uacute;til para realizar probas, xa que realiza substituci&oacute;ns aleatorias de caracteres.</p><img src="/img/infix3.png" alt="infix3.png"></img><p>Como tende a ser habitual cos aspectos t&eacute;cnicos (e coa traduci&oacute;n), existen alg&uacute;ns problemas.</p>

<p>&Eacute; posible que se atope con que a fontes incrustadas no PDF non conte&ntilde;en todos os caracteres que precisa. Una soluci&oacute;n ser&iacute;a obter e instalar as fontes necesarias, ou empregar unha fonte distinta (o cal pode non ser unha soluci&oacute;n adecuada).</p>

<p>&Eacute; moi probable que en certos puntos a s&uacute;a traduci&oacute;n sexa m&aacute;is longa ca o texto orixinal. Deber&aacute; solucionar este problema a trav&eacute;s de Infix, onde poder&iacute;a, por exemplo, aumentar o tama&ntilde;o da caixa que cont&eacute;n o texto. Infix ten funci&oacute;ns para lidar con estes e outros problemas que van m&aacute;is al&aacute; da intenci&oacute;n desta gu&iacute;a.</p>

<p>Pode atoparse con segmentos rotos por saltos de li&ntilde;a forzados en lugares inapropiados. Esta situaci&oacute;n pode resultarlle familiar se traduciu ficheiros de PowerPoint en OmegaT ou calquera outra ferramenta TAC. Para resolvelo, volva a abrir o ficheiro PDF orixinal en Infix. Seleccione Tools &gt; Text tool. Ao facer clic no texto en cuesti&oacute;n aparecer&aacute; unha caixa de texto e marcas de formato. A captura de pantalla mostra un exemplo: <img src="/img/infix4.png" alt="infix4.png"></img> Elimine o salto de li&ntilde;a. Garde os cambios e volva exportar o PDF ao ficheiro XML (e cambie a extensi&oacute;n do ficheiro se fose necesario) e volva cargar o seu proxecto de OmegaT. Se o seu ficheiro cont&eacute;n moitos saltos inapropiados resultar&aacute; m&aacute;is eficiente eliminalos todos nunha soa ocasi&oacute;n, alternando entre OmegaT e Infix para situalos.</p>

<p>Alg&uacute;ns saltos de li&ntilde;a inadecuados poden requirir que cambie a posici&oacute;n do texto. Nestes casos, resulta pr&aacute;ctico eliminalos antes de exportar o ficheiro a XML para obter segmentos cohesionados para traducir, e despois volver a introducilos en Infix ao final do proceso.</p>

<p>Copyright Marc Prior 2011</p>

</div>





    <footer class="container-fluid text-center">
  <a href="#page" title="To Top">
    <span class="glyphicon glyphicon-chevron-up"><!----></span>
  </a>
  <div class="container-fluid">
      <div class="col-sm-offset-3 col-sm-2 footer-column">
        <h4>Connect</h4>
        <div class="header-line"><!----></div>
        <div class="footer-links">
          <ul>
            <li><a href="https://sourceforge.net/projects/omegat/"><img alt="Sourceforge" src="/img/sourceforge.svg" height="24" width="24"/> Sourceforge</a></li>
            <li><a href="https://github.com/omegat-org/"><img alt="Github" src="/img/github.svg" height="24" width="24"/> Github</a></li>
            <li><a href="https://twitter.com/OmegaTOfficial"><img alt="Twitter" src="/img/twitter.svg" height="24" width="24"/> Twitter</a></li>
            <li><a href="https://www.facebook.com/OmegaTOfficial"><img alt="Facebook" src="/img/facebook.svg" height="24" width="24"/> Facebook</a></li>
          </ul>
        </div>
      </div>
      <div class="col-sm-2 footer-column">
        <h4>Documentation</h4>
        <div class="header-line"><!----></div>
        <div class="footer-links">
          <ul>
            <li><a href="/gl/documentation#manual"><span class="glyphicon glyphicon-book"></span> Manual</a></li>
            <li><a href="/gl/documentation#tutorials"><span class="glyphicon glyphicon-user"></span> Tutorials</a></li>
            <li><a href="/gl/documentation#howto"><span class="glyphicon glyphicon-question-sign"></span> How-To</a></li>
            <li><a href="/gl/reviews"><span class="glyphicon glyphicon-heart"></span> Comentarios de OmegaT</a></li>
          </ul>
        </div>
      </div>
      <div class="col-sm-2 footer-column">
        <h4>The OmegaT Project</h4>
        <div class="header-line"><!----></div>
        <div class="footer-links">
          <ul>
            <li>
            <a href="/gl/contact"><span class="glyphicon glyphicon-envelope"></span> Contacto e soporte</a>
            </li>
            <li>
            <a href="/gl/about"><span class="glyphicon glyphicon-question-sign"></span> Quen somos</a>
            </li>
            <li>
            <a href="/gl/philosophy"><span class="glyphicon glyphicon-console"></span> Filosof&iacute;a</a>
            </li>
          </ul>
        </div>
      </div>
  </div>
  <p class="footer-copyright">Copyright &#xA9; 2017 - <a href="/gl/">omegat.org</a></p>
</footer>


  </body>

</html>

